---
kind: method
id: M:Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModel.GetAnalyticalShadingSurfaces
source: html/077e6fbd-8634-346c-6f62-50b6dde554de.htm
---
# Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModel.GetAnalyticalShadingSurfaces Method

The collection of analytical shading surfaces.

## Syntax (C#)
```csharp
public IList<EnergyAnalysisSurface> GetAnalyticalShadingSurfaces()
```

## Returns
Returns the analytical shading surfaces after model calculation.